// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

// Описать метод нахожения случайного числа от 100 до 999
// Описать метод нахождения второй цифры числа 
// Описать метод вывода искомой цифры

// int num = new Random().Next(100, 999);
// Console.WriteLine(num);
// int i = 0;
// int result = num;
// while (i < 1)
// {
//     i++;
// }
// Console.WriteLine(i = 1);

string num = 1234.ToString();
Console.WriteLine(num[1]);