// Дан массив, необходимо сформировать
// новый массив из четных чисел

// 1. Задать количество элементов.
// 2. Задать массив в котором хранятся элементы.
// 3. Заполнить массив случайными числами.
// 4. Распечатать исходный массив.
// 5. Найти количество четных чисел в массиве
// 6. Задать массив в котором будут четные числа
// 7. Заполнить ассив в котором будут четные числа
// 8. Распечатать массив с четными числами.
//





// 1.
int size = new Random().Next(10, 20);

// 2.
int[] array = new int[size];

// 3.

